/*
//创建一个数组
var a = [1,true,'Hello Word'];
//输出数组a
console.log(a);
//控制台输出
//0: 1
//1: true
//2: "Hello Word"
//length: 3
//[[Prototype]]: Array(0)
*/
/*
//创建一个数组
var a = [100,200,300,400];
//输出a
console.log(a);
//获取数组的长度
console.log(a.length);
//浏览器输出
//(4) [100, 200, 300, 400]
//4
//修改数组的长度
a.length = 3;
//输出a
console.log(a);
//浏览器输出
//(4) [100, 200, 300, 400]
//4
//(3) [100, 200, 300]
//修改数组的长度
a.length = 5;
//输出a
console.log(a);
//浏览器输出
//(4) [100, 200, 300, 400]
//4
//(3) [100, 200, 300,Null]
*/
/*
//创建一个数组
var a = [100,200,300,400];
//输出a
console.log(a);
//输出数组索引2的数据
console.log(a[2]);
//浏览器输出
//(4) [100, 200, 300, 400]
//300
//修改数组中索引为2的数据
a[2] = 114514;
//输出a
console.log(a);
//输出数组索引2的数据
console.log(a[2]);
//浏览器输出
//(4) [100, 200, 300, 400]
//300
//(4) [100, 114514, 300, 400]
//114514
*/
//创建一个数组
var a = [100,200,300,400];
//输出a
console.log(a);
//定义循环
for (i =0;
    i <a.length;
    i = i+1) {
        console.log(i);
        console.log(a[i]);
    }